xml-v4/InformationRegisters/TL_ПлотностьПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>TL_ПлотностьПартий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МассаКг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъёмЛитров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидТоплива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.TL_ВидыТоплива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АЗС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.TL_АЗС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml-v4/Catalogs/TL_АЗС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>TL_АЗС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСтанции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтанции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TL_ТипыСтанций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗакрытияСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

xml-v4/Catalogs/TL_ВидыОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>TL_ВидыОплат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TL_ТипыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВнешний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетПеремещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентОптовый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

xml-v4/Catalogs/TL_ВидыТоплива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>TL_ВидыТоплива</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураТонны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлотностьСправочная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МаппингПоСтанциям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АЗС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.TL_АЗС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураЛитры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

xml-v4/CommonModules/TL_Маппинг/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль TL_Маппинг
// Расширение TradeLedger для 1С:БП 3.0
// Контекст: Сервер, Экспорт
// Центральный модуль маппинга: внешние коды API → объекты 1С.
//
// Каждая функция содержит fallback на текущую логику (хардкод),
// если справочники расширения пусты или не созданы.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Найти АЗС по коду станции из API.
//
// Параметры:
//   КодСтанции - Число - код в API STS (208, 209, 5...)
//
// Возвращаемое значение:
//   СправочникСсылка.TL_АЗС или Неопределено
//
Функция НайтиАЗС(КодСтанции) Экспорт

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Ссылка
			|ИЗ
			|	Справочник.TL_АЗС
			|ГДЕ
			|	КодСтанции = &КодСтанции
			|	И НЕ ПометкаУдаления";

		Запрос.УстановитьПараметр("КодСтанции", КодСтанции);
		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	Исключение
		// Справочник TL_АЗС не существует
	КонецПопытки;

	Возврат Неопределено;

КонецФункции

// Найти склад АЗС по коду станции.
// Логика: TL_АЗС.Склад → fallback: поиск по маскам имён.
//
// Параметры:
//   КодСтанции - Число
//
// Возвращаемое значение:
//   СправочникСсылка.Склады (пустая ссылка если не найден)
//
Функция НайтиСкладСтанции(КодСтанции) Экспорт

	// 1. Поиск через справочник TL_АЗС
	АЗС = НайтиАЗС(КодСтанции);
	Если АЗС <> Неопределено Тогда
		Попытка
			Склад = АЗС.Склад;
			Если ЗначениеЗаполнено(Склад) И Не Склад.ПометкаУдаления Тогда
				Возврат Склад;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;

	// 2. Fallback: поиск по маскам наименования
	Возврат НайтиСкладПоМаскам(КодСтанции);

КонецФункции

// Найти номенклатуру топлива по внешнему коду.
//
// Параметры:
//   КодТоплива  - Строка - код из API ("92", "95", "DT", "DTw")
//   Единица     - Строка - "л" (литры) или "т" (тонны)
//   КодСтанции  - Число  - код станции (для N:1 маппинга литров по станциям)
//
// Возвращаемое значение:
//   СправочникСсылка.Номенклатура (пустая ссылка если не найдена)
//
Функция НайтиНоменклатуруТоплива(КодТоплива, Единица, КодСтанции = 0) Экспорт

	// 1. Поиск через справочник TL_ВидыТоплива
	ВидТоплива = НайтиВидТоплива(КодТоплива);

	Если ВидТоплива <> Неопределено Тогда

		Если НРег(Единица) = "т" Тогда
			// Тонны: общая номенклатура
			Попытка
				Номенклатура = ВидТоплива.НоменклатураТонны;
				Если ЗначениеЗаполнено(Номенклатура) Тогда
					Возврат Номенклатура;
				КонецЕсли;
			Исключение
			КонецПопытки;
		Иначе
			// Литры: ищем в табличной части МаппингПоСтанциям
			Если КодСтанции > 0 Тогда
				Попытка
					АЗС = НайтиАЗС(КодСтанции);
					Если АЗС <> Неопределено Тогда
						Для Каждого СтрокаМаппинга Из ВидТоплива.МаппингПоСтанциям Цикл
							Если СтрокаМаппинга.АЗС = АЗС Тогда
								Если ЗначениеЗаполнено(СтрокаМаппинга.НоменклатураЛитры) Тогда
									Возврат СтрокаМаппинга.НоменклатураЛитры;
								КонецЕсли;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	// 2. Fallback: хардкод маппинг + НайтиПоНаименованию
	Возврат НайтиНоменклатуруFallback(КодТоплива, Единица);

КонецФункции

// Найти вид оплаты по внешнему ключу из API (payments).
//
// Параметры:
//   КлючОплаты - Строка - ключ из JSON payments ("cash", "card", "voucher")
//
// Возвращаемое значение:
//   Структура("Склад, ТребуетПеремещения, КонтрагентОптовый") или Неопределено
//
Функция НайтиВидОплаты(КлючОплаты) Экспорт

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Ссылка.Склад КАК Склад,
			|	Ссылка.ТребуетПеремещения КАК ТребуетПеремещения,
			|	Ссылка.КонтрагентОптовый КАК КонтрагентОптовый
			|ИЗ
			|	Справочник.TL_ВидыОплат
			|ГДЕ
			|	КодВнешний = &КодВнешний
			|	И НЕ ПометкаУдаления";

		Запрос.УстановитьПараметр("КодВнешний", КлючОплаты);
		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() Тогда
			Возврат Новый Структура("Склад, ТребуетПеремещения, КонтрагентОптовый",
				Выборка.Склад,
				Выборка.ТребуетПеремещения,
				Выборка.КонтрагентОптовый);
		КонецЕсли;
	Исключение
		// Справочник TL_ВидыОплат не существует
	КонецПопытки;

	Возврат Неопределено;

КонецФункции

// Получить плотность топлива для пересчёта тонны → литры.
// Нормализовать дату смены с учётом времени закрытия станции.
// Если станция закрывает смену в 07:00, то смена открытая 22.03 в 00:01
// относится к финансовому дню 21.03.
//
// Параметры:
//   ДатаСмены   - Дата
//   КодСтанции  - Число
//
// Возвращаемое значение:
//   Дата - нормализованная (начало дня)
//
Функция НормализоватьДатуСмены(ДатаСмены, КодСтанции) Экспорт

	Если Не ЗначениеЗаполнено(ДатаСмены) Тогда
		Возврат ДатаСмены;
	КонецЕсли;

	АЗС = НайтиАЗС(КодСтанции);
	Если АЗС = Неопределено Тогда
		Возврат НачалоДня(ДатаСмены);
	КонецЕсли;

	Попытка
		ВремяЗакрытия = АЗС.ВремяЗакрытияСмены;
	Исключение
		Возврат НачалоДня(ДатаСмены);
	КонецПопытки;

	Если Не ЗначениеЗаполнено(ВремяЗакрытия) Тогда
		Возврат НачалоДня(ДатаСмены);
	КонецЕсли;

	ЧасЗакрытия = Час(ВремяЗакрытия);
	Если ЧасЗакрытия = 0 Тогда
		Возврат НачалоДня(ДатаСмены);
	КонецЕсли;

	Если Час(ДатаСмены) < ЧасЗакрытия Тогда
		Возврат НачалоДня(ДатаСмены - 86400);
	КонецЕсли;

	Возврат НачалоДня(ДатаСмены);

КонецФункции

// Получить плотность топлива для пересчёта тонны → литры.
// Логика: TL_ПлотностьПартий (последняя запись) → fallback: ПлотностьСправочная из TL_ВидыТоплива.
//
// Параметры:
//   КодТоплива  - Строка - внешний код
//   КодСтанции  - Число
//   Дата        - Дата
//
// Возвращаемое значение:
//   Число - плотность (кг/л), 0 если не найдена
//
Функция ПолучитьПлотность(КодТоплива, КодСтанции, Дата) Экспорт

	ВидТоплива = Неопределено;

	// 1. Из регистра TL_ПлотностьПартий (последняя на дату)
	Попытка
		ВидТоплива = НайтиВидТоплива(КодТоплива);
		АЗС = НайтиАЗС(КодСтанции);

		Если ВидТоплива <> Неопределено И АЗС <> Неопределено Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	Плотность
				|ИЗ
				|	РегистрСведений.TL_ПлотностьПартий
				|ГДЕ
				|	ВидТоплива = &ВидТоплива
				|	И АЗС = &АЗС
				|	И ДатаПоступления <= &Дата
				|УПОРЯДОЧИТЬ ПО
				|	ДатаПоступления УБЫВ";

			Запрос.УстановитьПараметр("ВидТоплива", ВидТоплива);
			Запрос.УстановитьПараметр("АЗС", АЗС);
			Запрос.УстановитьПараметр("Дата", Дата);

			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() И Выборка.Плотность > 0 Тогда
				Возврат Выборка.Плотность;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;

	// 2. Fallback: справочная плотность из TL_ВидыТоплива
	Попытка
		Если ВидТоплива <> Неопределено Тогда
			Если ВидТоплива.ПлотностьСправочная > 0 Тогда
				Возврат ВидТоплива.ПлотностьСправочная;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;

	ЗаписьЖурналаРегистрации("TL_Маппинг",
		УровеньЖурналаРегистрации.Предупреждение, , ,
		"Плотность не найдена: топливо=" + КодТоплива
		+ ", станция=" + XMLСтрока(КодСтанции)
		+ ", дата=" + Формат(Дата, "ДФ='dd.MM.yyyy'"));

	Возврат 0;

КонецФункции

// Записать плотность партии в регистр TL_ПлотностьПартий.
//
Процедура ЗаписатьПлотность(КодТоплива, КодСтанции, Дата, Плотность, МассаКг, ОбъёмЛитров, НомерТТН) Экспорт

	Если Плотность = 0 Тогда
		Возврат;
	КонецЕсли;

	ВидТоплива = НайтиВидТоплива(КодТоплива);
	АЗС = НайтиАЗС(КодСтанции);

	Если ВидТоплива = Неопределено ИЛИ АЗС = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		МенеджерЗаписи = РегистрыСведений.TL_ПлотностьПартий.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ВидТоплива = ВидТоплива;
		МенеджерЗаписи.ДатаПоступления = Дата;
		МенеджерЗаписи.АЗС = АЗС;
		МенеджерЗаписи.Плотность = Плотность;
		МенеджерЗаписи.МассаКг = МассаКг;
		МенеджерЗаписи.ОбъёмЛитров = ОбъёмЛитров;
		МенеджерЗаписи.НомерТТН = НомерТТН;
		МенеджерЗаписи.Записать();
	Исключение
		// Регистр не существует — пропускаем
		ЗаписьЖурналаРегистрации("TL_Маппинг",
			УровеньЖурналаРегистрации.Предупреждение, , ,
			"Не удалось записать плотность: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Найти вид топлива по внешнему коду в справочнике TL_ВидыТоплива.
//
Функция НайтиВидТоплива(КодТоплива)

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Ссылка
			|ИЗ
			|	Справочник.TL_ВидыТоплива
			|ГДЕ
			|	ВнешнийКод = &ВнешнийКод
			|	И НЕ ПометкаУдаления";

		Запрос.УстановитьПараметр("ВнешнийКод", Строка(КодТоплива));
		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	Исключение
		// Справочник TL_ВидыТоплива не существует
	КонецПопытки;

	Возврат Неопределено;

КонецФункции

// Fallback: поиск склада по маскам наименования (текущая логика).
//
Функция НайтиСкладПоМаскам(КодСтанции)

	КодСтр = XMLСтрока(КодСтанции);

	ИскатьИмена = Новый Массив;
	ИскатьИмена.Добавить("АЗС-" + КодСтр);
	ИскатьИмена.Добавить("АЗС " + КодСтр);
	ИскатьИмена.Добавить("Станция " + КодСтр);
	ИскатьИмена.Добавить("Ст." + КодСтр);
	ИскатьИмена.Добавить("АКАЗС " + КодСтр);
	ИскатьИмена.Добавить("АКАЗС-" + КодСтр);
	ИскатьИмена.Добавить("АГЗС " + КодСтр);
	ИскатьИмена.Добавить("АГЗС-" + КодСтр);

	Для Каждого Имя Из ИскатьИмена Цикл
		Склад = Справочники.Склады.НайтиПоНаименованию(Имя, Истина);
		Если ЗначениеЗаполнено(Склад) Тогда
			Возврат Склад;
		КонецЕсли;
	КонецЦикла;

	ЗаписьЖурналаРегистрации("TL_Маппинг",
		УровеньЖурналаРегистрации.Предупреждение, , ,
		"Склад не найден для станции " + XMLСтрока(КодСтанции)
		+ ". Проверьте справочник TL_АЗС или наименования складов.");

	Возврат Справочники.Склады.ПустаяСсылка();

КонецФункции

// Fallback: хардкод маппинг кодов топлива → наименования в 1С.
//
Функция НайтиНоменклатуруFallback(КодТоплива, Единица)

	Маппинг = Новый Соответствие;
	Маппинг.Вставить("92",  "АИ-92");
	Маппинг.Вставить("95",  "АИ-95");
	Маппинг.Вставить("98",  "АИ-98");
	Маппинг.Вставить("DT",  "ДТ");
	Маппинг.Вставить("dt",  "ДТ");
	Маппинг.Вставить("ДТ",  "ДТ");
	Маппинг.Вставить("DTw", "ДТ зимн.");

	ИмяТоплива = Маппинг.Получить(Строка(КодТоплива));
	Если ИмяТоплива = Неопределено Тогда
		ИмяТоплива = Строка(КодТоплива);
	КонецЕсли;

	Наименование = ИмяТоплива + " (" + Единица + ")";

	Возврат Справочники.Номенклатура.НайтиПоНаименованию(Наименование, Истина);

КонецФункции

#КонецОбласти
